  var si = ['서울', '부산', '대구', '인천', '광주', '대전', '울산', '강원', '경기', '경남', '경북', '전남', '전북', '제주', '충남', '충북'];
    
            var gu = [['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'],
                ['강서구','금정구','남구','동구','동래구','부산진구','북구','사상구','사하구','서구','수영구','연제구','영도구','중구','해운대구','기장군'],
                ['남구','달서구','동구','북구','서구','수성구','중구','달성군'],
                ['계양구','남구','남동구','동구','부평구','서구','연수구','중구','강화군','옹진군'],
                ['광산구','남구','동구','북구','서구'],
                ['대덕구','동구','서구','유성구','중구'],
                ['남구','동구','북구','중구','울주군'],
                ['강릉시','동해시','삼척시','속초시','원주시','춘천시','태백시','고성군','양구군','양양군','영월군','인제군','정선군','철원군','평창군','홍천군','화천군','횡성군'],
                ['고양시 덕양구','고양시 일산동구','고양시 일산서구','과천시','광명시','광주시','구리시','군포시','김포시','남양주시','동두천시','부천시 소사구','부천시 오정구','부천시 원미구','성남시 분당구','성남시 수정구','성남시 중원구','수원시 권선구','수원시 영통구','수원시 장안구','수원시 팔달구','시흥시','안산시 단원구','안산시 상록구','안성시','안양시 동안구','안양시 만안구','양주시','오산시','용인시 기흥구','용인시 수지구','용인시 처인구','의왕시','의정부시','이천시','파주시','평택시','포천시','하남시','화성시','가평군','양평군','여주군','연천군'],
                ['거제시','김해시','마산시','밀양시','사천시','양산시','진주시','진해시','창원시','통영시','거창군','고성군','남해군','산청군','의령군','창녕군','하동군','함안군','함양군','합천군'],
                ['경산시','경주시','구미시','김천시','문경시','상주시','안동시','영주시','영천시','포항시 남구','포항시 북구','고령군','군위군','봉화군','성주군','영덕군','영양군','예천군','울릉군','울진군','의성군','청도군','청송군','칠곡군'],
                ['광양시','나주시','목포시','순천시','여수시','강진군','고흥군','곡성군','구례군','담양군','무안군','보성군','신안군','영광군','영암군','완도군','장성군','장흥군','진도군','함평군','해남군','화순군'],
                ['군산시','김제시','남원시','익산시','전주시 덕진구','전주시 완산구','정읍시','고창군','무주군','부안군','순창군','완주군','임실군','장수군','진안군'],
                ['제주시','서귀포시'],
                ['계룡시','공주시','논산시','보령시','서산시','아산시','천안시 동남구','천안시 서북구','금산군','당진군','부여군','서천군','연기군','예산군','청양군','태안군','홍성군'],
                ['제천시','청주시 상당구','청주시 흥덕구','충주시','괴산군','단양군','보은군','영동군','옥천군','음성군','증평군','진천군','청원군']];
            
            var container = document.getElementById('map');
            var options = {
                center: new kakao.maps.LatLng(37.5666805, 126.9784147),
                level: 9
            };
    
            var map = new kakao.maps.Map(container, options);
            var geocoder = new kakao.maps.services.Geocoder();
            for(var i=0;i<si.length;i++){   
                for(var j=0;j<gu[i].length;j++){
                  //  var tmp = gu[i][j];
                   // console.log("tmp" + tmp);

                    // 주소로 좌표를 검색합니다
                 // geocoder.addressSearch(`${si[i]} ${gu[i][j]}`, function(result, status) {
              	    geocoder.addressSearch(si[i] + " " +  gu[i][j], function(result, status) {
                        console.log(result);
                        var addr = result[0].address_name;
                        console.log(addr);
                        
                        //console.log(tmp);
                        // console.log(`${gu[i][j]}`);
                        
                    // 정상적으로 검색이 완료됐으면 
                    if (status === kakao.maps.services.Status.OK) {
                        var coords = new kakao.maps.LatLng(result[0].y, result[0].x);
                        // 결과값으로 받은 위치를 마커로 표시합니다
                        var marker = new kakao.maps.Marker({
                            map: map,
                            position: coords,
                        });

                        // 인포윈도우로 장소에 대한 설명을 표시합니다
                        var infowindow = new kakao.maps.InfoWindow({
                            content: `<div style="text-align:center;width:150px;">${result[0].address_name}</div>`,
                           // content: '<div style="text-align:center;width:150px;">addr.val()</div>',
                           // content: `<div style="width:150px;text-align:center;padding:6px 0;">${apart}</div>`
                            
                        });
                        
                         infowindow.open(map, marker);
                       //  infowindow.close();
                       map.setCenter(new kakao.maps.LatLng(37.50129420218191, 127.03960466814492));
                    } //if

                    //map.setCenter(new kakao.maps.LatLng(37.50129420218191, 127.03960466814492));
                });//addressSearch
            }//for j
            //map.setCenter(new kakao.maps.LatLng(37.50129420218191, 127.03960466814492));
        }//for i
        //map.setCenter(new kakao.maps.LatLng(37.50129420218191, 127.03960466814492));